// 满足条件执行if语句体，不满足执行else语句体
// 语法格式:
//        if (判断条件){
//        	执行语句1
//        	……
//        }else{
//        	执行语句2
//        	……
//        }


// 如果为真 执行嘿嘿  如果为假 执行呵呵
// 1.定义变量
// var bool = false;
// // 2.进行条件判断 如果为真 执行嘿嘿
// if (bool) {
//   console.log("嘿嘿");
// } else {
// // 3.否则 执行呵呵
//   console.log("呵呵"); 
// }





// 如60分以上及格，60分以下不及格，需要重考
// // 1.定义分数
// var score = 60;
// // 2.条件判断
// if (score >= 60) {
// // 3.如果超过60分 告诉他及格了
//   console.log("恭喜你，及格了");
// } else {
// // 4.否则 需要重考
//   console.log("抱歉，你需要重考");
// }

// 1、根据输入的数字，判断如果是1-5打印工作日，如果是6，7打印休息日。

// 1.1 定义变量 代表数字
var day = 6;
// 1.2 判断 数字是否大于5
if(day > 5) {
// 1.3 如果大于5 则为休息
  console.log("休息休息");
} else {
// 1.4 否则 继续上课
  console.log("继续上课");
}



