// 在多个条件中选择满足条件的if语句体执行
// 语法格式: 
          // if (判断条件1) {
          //   执行语句1
          // } else if (判断条件2) {
          //   执行语句2
          // }
          // ...
          // else if (判断条件n) {
          //   执行语句n
          // } else {
          //   执行语句
          // }

// 小例子: 让电脑告诉我们 1-5之间 的数字是几
// 1.定义变量 数字
// var num = 7;
// // 2.判断是几 就打印 一句话 这是几
// if (num == 1) {
//   console.log("这是一");
// } else if (num == 2) {
//   console.log("这是二");
// } else if (num == 3) {
//   console.log("这是三");
// } else if (num == 4) {
//   console.log("这是四");
// } else if (num == 5) {
//   console.log("这是五");
// } else {
// // 3.如果都不是 那么就打印 "异常"
//   console.log("超出范围了,异常");
// }

// 步骤: 
// 对一个学生的考试成绩进行等级的划分，(知道学生的考试成绩 定义一个变量)
var score = -1;
// 如果分数大于等于80分，小于等于100分等级为优；(如果分数在80分及以上 100分及以下 打印优秀)
if (score >= 80 && score <= 100) {
  console.log("优秀");
} else if (score >= 70 && score < 80) {
// 如果分数大于等于70分，小于80分级为良；(如果分数在70分及以上 80分以下 为良)
  console.log("良");
} else if (score >= 60 && score < 70) {
// 如果分数大于等于60分，小于70分等级为及格；(如果分数在60分及以上, 70分以下 为及格)
  console.log("及格");
} else if (score < 60 && score >= 0) {
  // 60以下为不及格；(分数应该在60分以下 0分及以上)
  console.log("不及格");
} else {
// 大于100或者小于0则分数异常。(否则 就是分数异常)
  console.log("分数异常");
}


// 重要重要重要!!!   写完代码 一定一定要测试  

//  不怕代码报错 就怕不报错






