// 分数的优良中差

// 知识点: if else if  else


// 优: >= 80  <= 100
// 良: >= 70   < 80
// 中: >=60    < 70
// 差: >=0  < 60
// 否则: 分数 异常


// 1.定义一个变量 用来表示 成绩
// var score = 70.1;

// if (score >=80 && score <=100) {
// // 2.判断  成绩是否>= 80  <= 100 如果是 打印 优秀
// console.log("优秀");
// } else if (score >= 70 && score < 80) {
// // 3.判断  成绩是否>= 70   < 80  如果是 打印 良好
// console.log("良好");
// } else if (score >= 60 && score < 70) {
// // 4.判断  成绩是否>=60    < 70 如果是 打印  及格
// console.log("及格");
// } else if (score >= 0 && score < 60) {
// // 5.判断  成绩是否>=0  < 60 如果是 打印  不及格
// console.log("不及格");
// } else {
//   console.log("分数异常");
// }








// 先判断 分数是否 >=0  <=100
// 再判断优良中差