// 1.数组的概念:  一组有序数据的集合

// 2.数组的定义格式:
  // 2.1 有数据的数组
  //  var 变量名 = [数据, 数据, 数据,... 数据];

  // var names = ['刘敏', '舒榆衡', '雷名锴', '孙楠', '刘硕', '王鹏为', '李嘉鹏' ];

  // console.log(names);
  // 2.2 如果数组没有数据
  // var arr = [];
  // console.log(arr);


// 3.数组的元素: 数组中的每个数据
//  比如: 刘敏', '舒榆衡', '雷名锴', 每个人的名字 就是元素

// var num = [1,2,3,4,5];


// 4.数组的索引(下标)： 就是元素在数组中排第几  序号从0开始
// var names = ['刘敏', '舒榆衡', '雷名锴', '孙楠', '刘硕', '王鹏为', '李嘉鹏' ];

// 5.数组的长度: 就是数组中有几个元素 长度就是几
// 如何获取数组的长度呢？ 
// 格式: 变量.length

// var names = ['刘敏', '舒榆衡', '雷名锴', '孙楠', '刘硕' ];

// console.log(names.length);

// 6.数组的长度和索引之间的关系

//  索引的最大值 = 数组的length -1
